# CurveLoopIterator Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
CurveLoopIterator Class
Members See Also
---
An iterator to a curve loop.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public class CurveLoopIterator : IEnumerator<Curve>
```

Visual Basic
---
```text
Public Class CurveLoopIterator _
	Implements IEnumerator(Of Curve)
```

Visual C++
---
```text
public ref class CurveLoopIterator : IEnumerator<Curve^>
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..CurveLoopIterator
# See Also
CurveLoopIterator Members
Autodesk.Revit.DB Namespace